---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LockedEndOffset
source: html/9458655c-52a8-d792-b666-eba9899de758.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LockedEndOffset Property

"Positive Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId LockedEndOffset { get; }
```